Lets Begin

#### What Is SQLAlchemy?

SQLAlchemy is a Python SQL toolkit and **Object Relational Mapper** (ORM).
- It allows you to talk to your database (like MySQL, PostgreSQL, SQLite, etc.) using Python code instead of raw SQL.

It gives you two layers:
- Core → For writing SQL-like queries but in Python syntax.
- ORM (Object Relational Mapper) → For working with classes and objects instead of tables and rows.

In [2]:
from sqlalchemy import create_engine, text
engine = create_engine("mysql+pymysql://root:Harman%40123@localhost/Datasets")

In [3]:
with engine.connect() as conn:
    result = conn.execute(text("SELECT 1"))
    print(result.scalar())

1

Why use text() and :sal?

It prevents SQL injection.

It makes queries parameterized and secure.

In [4]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import text


engine = create_engine("mysql+pymysql://root:Harman%40123@localhost/Datasets")


def run_query(query):
    """
    Run a SELECT query and return results as a pandas DataFrame
    """
    return pd.read_sql(query, engine)


def run_command(query):
    """
    Execute INSERT/UPDATE/DELETE/CREATE queries using SQLAlchemy
    """
    with engine.begin() as conn:  
        conn.execute(text(query))  # wrap query in text()
        print("Query executed successfully")

In [ ]:
dept_creation = '''
CREATE TABLE departments (
    dept_id INT PRIMARY KEY AUTO_INCREMENT,
    dept_name VARCHAR(100) NOT NULL,
    manager_id INT,
    budget DECIMAL(12,2),
    location VARCHAR(100)
);
'''

dept_insert = '''
INSERT INTO departments (dept_name, manager_id, budget, location) VALUES
('Engineering', 101, 5000000, 'New York'),
('Finance', 102, 2500000, 'Chicago'),
('Human Resources', 103, 1200000, 'Boston'),
('Marketing', 104, 2000000, 'San Francisco'),
('Data Science', 105, 4000000, 'Seattle');
'''

emp_creation = '''
CREATE TABLE employees (
    emp_id INT PRIMARY KEY AUTO_INCREMENT,
    emp_name VARCHAR(100),
    gender ENUM('M','F'),
    hire_date DATE,
    salary DECIMAL(10,2),
    dept_id INT,
    designation VARCHAR(50),
    performance_rating INT,
    FOREIGN KEY (dept_id) REFERENCES departments(dept_id)
);
'''

emp_insert = '''
INSERT INTO employees (emp_name, gender, hire_date, salary, dept_id, designation, performance_rating) VALUES
('Harman Talwar', 'M', '2019-06-10', 85000, 1, 'Backend Engineer', 5),
('Sahil Kapoor', 'M', '2021-03-15', 65000, 1, 'Frontend Developer', 4),
('Neha Sharma', 'F', '2020-08-20', 72000, 5, 'Data Analyst', 3),
('Priya Nair', 'F', '2018-01-12', 95000, 2, 'Finance Lead', 5),
('Rohan Mehta', 'M', '2022-05-23', 60000, 3, 'HR Associate', 4),
('Aditi Singh', 'F', '2020-09-09', 88000, 1, 'DevOps Engineer', 4),
('Rahul Verma', 'M', '2017-04-02', 110000, 1, 'Tech Lead', 5),
('Kavita Joshi', 'F', '2019-11-18', 78000, 4, 'Marketing Specialist', 3),
('Arjun Patel', 'M', '2022-07-01', 55000, 3, 'Recruiter', 2),
('Vanshika Rao', 'F', '2021-01-25', 82000, 5, 'ML Engineer', 4);
'''

projects_creation = '''
CREATE TABLE projects (
    project_id INT PRIMARY KEY AUTO_INCREMENT,
    project_name VARCHAR(100),
    start_date DATE,
    end_date DATE,
    budget DECIMAL(12,2),
    dept_id INT,
    lead_id INT,
    status ENUM('Ongoing', 'Completed', 'On Hold'),
    FOREIGN KEY (dept_id) REFERENCES departments(dept_id),
    FOREIGN KEY (lead_id) REFERENCES employees(emp_id)
);
'''

project_insertion = '''
INSERT INTO projects (project_name, start_date, end_date, budget, dept_id, lead_id, status) VALUES
('E-Commerce Revamp', '2023-01-01', NULL, 1500000, 1, 7, 'Ongoing'),
('Payroll Automation', '2022-03-01', '2023-01-31', 800000, 2, 4, 'Completed'),
('Recruitment Portal', '2025-08-15', NULL, 400000, 3, 5, 'Ongoing'),
('Ad Campaign 2023', '2023-02-01', '2023-05-15', 500000, 4, 8, 'Completed'),
('Customer Segmentation', '2023-04-10', NULL, 1200000, 5, 10, 'Ongoing');
'''

run_command(dept_creation)
run_command(dept_insert)
run_command(emp_creation)
run_command(emp_insert)
run_command(projects_creation)
run_command(project_insertion)

# print(query)

In [9]:
run_query("SHOW DATABASES")

             Database
0            Datasets
1               inato
2          inato_data
3  information_schema
4               mysql
5  performance_schema
6                 sys

In [27]:
run_query("SELECT * FROM departments")

   dept_id        dept_name  manager_id     budget       location
0        1      Engineering         101  5000000.0       New York
1        2          Finance         102  2500000.0        Chicago
2        3  Human Resources         103  1200000.0         Boston
3        4        Marketing         104  2000000.0  San Francisco
4        5     Data Science         105  4000000.0        Seattle

In [26]:
run_query("SELECT * FROM employees")

,emp_id,emp_name,gender,hire_date,salary,dept_id,designation,performance_rating
0,1,Harman Talwar,M,2019-06-10,85000.0,1,Backend Engineer,5
1,2,Sahil Kapoor,M,2021-03-15,65000.0,1,Frontend Developer,4
2,3,Neha Sharma,F,2020-08-20,72000.0,5,Data Analyst,3
3,4,Priya Nair,F,2018-01-12,95000.0,2,Finance Lead,5
4,5,Rohan Mehta,M,2022-05-23,60000.0,3,HR Associate,4
5,6,Aditi Singh,F,2020-09-09,88000.0,1,DevOps Engineer,4
6,7,Rahul Verma,M,2017-04-02,110000.0,1,Tech Lead,5
7,8,Kavita Joshi,F,2019-11-18,78000.0,4,Marketing Specialist,3
8,9,Arjun Patel,M,2022-07-01,55000.0,3,Recruiter,2
9,10,Vanshika Rao,F,2021-01-25,82000.0,5,ML Engineer,4

In [7]:
run_query("SELECT * FROM projects")

,project_id,project_name,start_date,end_date,budget,dept_id,lead_id,status
0,1,E-Commerce Revamp,2023-01-01,None,1500000.0,1,7,Ongoing
1,2,Payroll Automation,2022-03-01,2023-01-31,800000.0,2,4,Completed
2,3,Recruitment Portal,2022-08-15,None,400000.0,3,5,Ongoing
3,4,Ad Campaign 2023,2023-02-01,2023-05-15,500000.0,4,8,Completed
4,5,Customer Segmentation,2023-04-10,None,1200000.0,5,10,Ongoing

1. List all employees along with their department names.

In [34]:
run_query(
'''
select e.emp_name, d.dept_name 
from employees e
join departments d
on e.dept_id = d.dept_id;   
'''
)

        emp_name        dept_name
0  Harman Talwar      Engineering
1   Sahil Kapoor      Engineering
2    Aditi Singh      Engineering
3    Rahul Verma      Engineering
4     Priya Nair          Finance
5    Rohan Mehta  Human Resources
6    Arjun Patel  Human Resources
7   Kavita Joshi        Marketing
8    Neha Sharma     Data Science
9   Vanshika Rao     Data Science

2. Find total salary paid by each department.

In [77]:
run_query(
'''
select d.dept_name, sum(e.salary) as total_salary_paid
from departments d
left join employees e
on d.dept_id = e.dept_id
group by d.dept_id; 
'''
)

         dept_name  total_salary_paid
0      Engineering           348000.0
1          Finance            95000.0
2  Human Resources           115000.0
3        Marketing            78000.0
4     Data Science           154000.0

3. Find department with the highest average salary.

In [72]:
run_query(
'''
select d.dept_name, avg(e.salary) as total_avg_salary
from departments d
join employees e
on d.dept_id = e.dept_id
group by d.dept_id
order by total_avg_salary desc
limit 1;
'''
)

  dept_name  total_avg_salary
0   Finance           95000.0

4. Get employees who joined after 2020 and are earning above their department’s average salary.

In [70]:
run_query(
'''
select e.emp_id, e.emp_name, e.hire_date, e.salary, d.dept_name  
from employees e
join departments d on e.dept_id = d.dept_id
where year(e.hire_date) > 2020 and e.salary > (select avg(salary) from employees where dept_id = e.dept_id);
'''

)

   emp_id      emp_name   hire_date   salary        dept_name
0       5   Rohan Mehta  2022-05-23  60000.0  Human Resources
1      10  Vanshika Rao  2021-01-25  82000.0     Data Science

5. List all ongoing projects with their department and lead employee name.

In [80]:
run_query(
'''
select p.project_name, d.dept_name, e.emp_name, p.status
from projects p
join departments d on p.dept_id = d.dept_id
join employees e on p.lead_id = e.emp_id
where p.status = 'Ongoing';
'''
)

            project_name        dept_name      emp_name   status
0      E-Commerce Revamp      Engineering   Rahul Verma  Ongoing
1     Recruitment Portal  Human Resources   Rohan Mehta  Ongoing
2  Customer Segmentation     Data Science  Vanshika Rao  Ongoing

6. Count how many employees each department has, including departments with zero employees.

In [86]:
run_query(
'''
select d.dept_name, count(e.emp_id), group_concat(e.emp_name) as employees
from departments d
left join employees e 
on d.dept_id = e.dept_id
group by d.dept_id;
'''
)

,dept_name,count(e.emp_id),employees
0,Engineering,4,"Harman Talwar,Sahil Kapoor,Aditi Singh,Rahul V..."
1,Finance,1,Priya Nair
2,Human Resources,2,"Rohan Mehta,Arjun Patel"
3,Marketing,1,Kavita Joshi
4,Data Science,2,"Neha Sharma,Vanshika Rao"

7. Find departments that do not have any ongoing project.

In [88]:
run_query(
'''
select d.dept_name, p.status
from departments d
join projects p
on d.dept_id = p.dept_id
where p.status = 'completed'
'''
)

   dept_name     status
0    Finance  Completed
1  Marketing  Completed

8. Get employees whose salary is above the overall company average.

In [90]:

run_query(
'''
select emp_name, salary
from employees
where salary > (select avg(salary) from employees);
'''
)

        emp_name    salary
0  Harman Talwar   85000.0
1     Priya Nair   95000.0
2    Aditi Singh   88000.0
3    Rahul Verma  110000.0
4   Vanshika Rao   82000.0

9. Find employees who are leads of at least one project.

In [ ]:

run_query(
'''
select e.emp_name
from employees e
join projects p
on p.lead_id = e.emp_id
'''
)

       emp_name
0    Priya Nair
1   Rohan Mehta
2   Rahul Verma
3  Kavita Joshi
4  Vanshika Rao

10. Find the second highest salary in the company.

In [6]:

run_query(
'''
select salary
from employees
order by salary desc
limit 1 offset 1;
'''
)

    salary
0  95000.0

11. Find employees who earn the maximum salary within their department.

In [35]:

run_query(
'''

with salary_data as (select e.emp_name, d.dept_name, e.salary,
        max(e.salary) over(partition by d.dept_name) as max_salary
from employees e
join departments d
on e.dept_id = d.dept_id
)
select emp_name, dept_name, max_salary
from salary_data
where salary = max_salary
'''
)

       emp_name        dept_name  max_salary
0  Vanshika Rao     Data Science     82000.0
1   Rahul Verma      Engineering    110000.0
2    Priya Nair          Finance     95000.0
3   Rohan Mehta  Human Resources     60000.0
4  Kavita Joshi        Marketing     78000.0

12. List departments whose total budget is greater than the sum of all project budgets.

In [ ]:

run_query(
'''

'''
)

C. Window Functions (Analytical Queries)

Show each employee’s salary rank within their department.

In [ ]:
run_query("""
select e.emp_name, d.dept_name, e.salary, 
        RANK() over(partition by d.dept_name order by e.salary desc) as ranking
        from employees e
        join departments d
        on e.dept_id = d.dept_id    
""")

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ') over(partition by d.dept_name order by e.salary desc) as ranking\n        from ' at line 2")
[SQL:
select e.emp_name, d.dept_name, e.salary,
        sum() over(partition by d.dept_name order by e.salary desc) as ranking
        from employees e
        join departments d
        on e.dept_id = d.dept_id
]
(Background on this error at: https://sqlalche.me/e/20/f405)

Calculate the running total of salary per department ordered by hire_date.

In [24]:
run_query("""
select e.emp_name, d.dept_name, e.hire_date, e.salary, 
        SUM(e.salary) over (partition by d.dept_name order by e.hire_date ) as running_total
        from employees e
        join departments d
        on e.dept_id = d.dept_id    
""")

        emp_name        dept_name   hire_date    salary  running_total
0    Neha Sharma     Data Science  2020-08-20   72000.0        72000.0
1   Vanshika Rao     Data Science  2021-01-25   82000.0       154000.0
2    Rahul Verma      Engineering  2017-04-02  110000.0       110000.0
3  Harman Talwar      Engineering  2019-06-10   85000.0       195000.0
4    Aditi Singh      Engineering  2020-09-09   88000.0       283000.0
5   Sahil Kapoor      Engineering  2021-03-15   65000.0       348000.0
6     Priya Nair          Finance  2018-01-12   95000.0        95000.0
7    Rohan Mehta  Human Resources  2022-05-23   60000.0        60000.0
8    Arjun Patel  Human Resources  2022-07-01   55000.0       115000.0
9   Kavita Joshi        Marketing  2019-11-18   78000.0        78000.0

Find top 2 employees in each department by performance rating.

In [39]:
run_query("""
with rank_by_performance as (
        select e.emp_name, d.dept_name, e.performance_rating, e.salary, 
        RANK() over (partition by d.dept_name order by e.performance_rating desc ) as rating 
        from employees e
        join departments d
        on e.dept_id = d.dept_id
)
select emp_name, dept_name, rating
from rank_by_performance
where rating <= 2
""")

        emp_name        dept_name  rating
0   Vanshika Rao     Data Science       1
1    Neha Sharma     Data Science       2
2  Harman Talwar      Engineering       1
3    Rahul Verma      Engineering       1
4     Priya Nair          Finance       1
5    Rohan Mehta  Human Resources       1
6    Arjun Patel  Human Resources       2
7   Kavita Joshi        Marketing       1


Find the difference between each employee’s salary and their department’s average salary.

In [10]:
run_query(
"""
with dept_avg as (select e.emp_name, d.dept_name, e.salary, 
        avg(e.salary) over (partition by d.dept_name) as avg_dept_salary
        from employees e
        join departments d
        on e.dept_id = d.dept_id   
)
select emp_name, dept_name, salary, avg_dept_salary,
(salary - avg_dept_salary) as diff_salary
from dept_avg
"""
)

        emp_name        dept_name    salary  avg_dept_salary  diff_salary
0    Neha Sharma     Data Science   72000.0          77000.0      -5000.0
1   Vanshika Rao     Data Science   82000.0          77000.0       5000.0
2  Harman Talwar      Engineering   85000.0          87000.0      -2000.0
3   Sahil Kapoor      Engineering   65000.0          87000.0     -22000.0
4    Aditi Singh      Engineering   88000.0          87000.0       1000.0
5    Rahul Verma      Engineering  110000.0          87000.0      23000.0
6     Priya Nair          Finance   95000.0          95000.0          0.0
7    Rohan Mehta  Human Resources   60000.0          57500.0       2500.0
8    Arjun Patel  Human Resources   55000.0          57500.0      -2500.0
9   Kavita Joshi        Marketing   78000.0          78000.0          0.0



🧩 D. Common Table Expressions (CTEs) & Recursive Queries

Using a CTE, show department-wise average salary and join it with department details.

Recursive CTE: Generate a sequence of project years from 2020 to 2025.

Find all employees hired before the average hire date using a CTE.

🧩 E. Date & Time Functions

Find employees who have worked for more than 4 years.

Calculate project durations (in days) for completed projects.

Find average duration of completed projects per department.

In [28]:
run_query(
'''
SELECT dept_name, emp_name, salary
FROM (
    SELECT
        d.dept_name,e.emp_name,e.salary,
        ROW_NUMBER() OVER (PARTITION BY d.dept_name ORDER BY e.salary DESC) AS rn
    FROM
        employees e 
        join departments d on e.dept_id = d.dept_id
) AS rnk
WHERE rn = 1;
'''
)

         dept_name      emp_name    salary
0     Data Science  Vanshika Rao   82000.0
1      Engineering   Rahul Verma  110000.0
2          Finance    Priya Nair   95000.0
3  Human Resources   Rohan Mehta   60000.0
4        Marketing  Kavita Joshi   78000.0